
/************************************************************************/
.equ x, 45                /* x=45 */
.equ y, 64                /* y=64 */
.equ stack_top, 0x1000    /* 栈顶指针指向地址0x1000 */
.global _start

/*----------------------------------------------------------------------------------*/
/*  code  实现45+64       */
/*----------------------------------------------------------------------------------*/

.text
_start: 
		mov sp, #stack_top     /* 堆栈指针SP指向栈顶指针指向的地址0x1000 */
		mov r0, #x             /* 将x的值45存放到r0中 */
		str  r0, [sp]          /* 将r0中的字数据写入以SP为地址的存储器中 */
		mov r0, #y             /* 将 y 的值64放入R0中 */
		ldr  r1, [sp]          /* 取堆栈中的数据到R1中 */
		add r0, r0, r1         /*  r0 <- r0+ r1  */
		str  r0, [sp]          /* 将r0中的字数据写入以SP为地址的存储器中 */

stop:
        b  stop                /* end the  code ，cycling */
.end